<template>
  <div class="history">
    <div v-for="(item, index) in data" :key="index">
      <div v-if="item != null">
        <div class="header">
          <div class="box">
            ЎЗБЕКИСТОН РЕСПУБЛИКАСИ СОҒЛИҚНИ САҚЛАШ ВАЗИРЛИГИ «СОҒЛОМ ТУРМУШ»
            МАЪСУЛИЯТИ ЧЕКЛАНГАН ЖАМИЯТИ
          </div>
          <div class="box">
            <img src="../../../public/future.jpg" alt="" />
          </div>
          <div class="box">
            КТУТ бўйича муассаса коди 91514 Ўзб.РССВ 26.06.2006 №287 буйруқ
            билан тасдиқланган 003-сонли тиббий хужжат шакли
          </div>
        </div>
        <div class="titles">
          КАСАЛХОНАДАГИ БЕМОРНИНГ ТИББИЙ ТАРИХИ №
        </div>
        <div
          class="palata"
          v-for="(item, index) in item.registration_palata"
          :key="index"
        >
          <div>
            Касалхонага ётқизилган кун ва вақти: {{ item.date_to | moment }}
          </div>
          <div>
            Касалхонадан чиқарилган куни ва вақти {{ item.date_do | moment }}
          </div>
          <div>бўлим, палата № {{ item.palatas.name }}</div>
          <div>кун ётиб даволанган {{ item.day }}</div>
          <div>
            Беморни олиб юриш турлари: ўзи юра олади
          </div>
          <div>
            Қон гурухи_________________резус омили
          </div>
          <div>Дориларнинг ножўя таъсири кузатилмаган</div>
        </div>
        <div>
          1. Фамилияси, исми, шарифи: {{ item.patient.fullname }} <br />
          2. ЖИНСИ: {{ item.patient.gender }} <br />
          3.Ёши {{ item.patient.birthday | moment }} – йил; (Тўлиқ ёшли болалар
          учун: 1 ёшгача-ойлар хисобида <br />
          4. Доимий яшаш жойи: шахар, қишлоқ (тагига чизилсин)
          {{ item.patient.region.name }} <br />
          5. Иш жойи касби, лавозими: <br />
          6. Бемор қаердан юборилган <br />
          7. Касалхонага шошилинч равишда келтирилган <br />
          8. Бемор йўлланмасидаги диагнози_ <br />
          9. Клиникада қўйилган диагноз: <br />
          10.Қабулхонада қўйилган диагнози: <br />
        </div>
        <table>
          <tr>
            <th>
              Касалхонада қўйилган диагноз
            </th>
            <th>
              Касаллик аниқланган сана
            </th>
            <th>Врач имзоси</th>
          </tr>
          <tr>
            <td>1</td>
            <td>1</td>
            <td>1</td>
          </tr>
          <tr>
            <td>1</td>
            <td>1</td>
            <td>1</td>
          </tr>
        </table>

        <div>
          Касалхонада қўйилган якуний диагноз <br />
          а) асосий <br />
          б) асосий касалликни асорати: _____________________________________
          <br />
          в) аниқланган бошқа касалликлар ______ ____________________________
          <br />
          Даволовчи врач_ Бўлим мудири Жалилов Ш. <br />
          «___ »________» _______йил Соат 14 : 00
        </div>
        <div>
          <div class="title">КЕЛГАНДАГИ ШИКОЯТЛАРИ</div>
          Бемор: {{ item.patient.fullname }} <br />
          <div v-html="item.complaint"></div>
          <br />
          <div class="title">АNAМNЕSIS МОRBI</div>
          Бемор ўзини ___________дан бери хаста хисоблайди. Ўз хасталигини
          сабабини хеч нарса билан боғламайди. Дастлаб талвасаси
          ___________________________безовта қилди. Талвасаси ____________
          атрофида ўтиб кетади. Бемор ўз хасталиги юзасидан яшаш жойидаги
          шифохоналарда стационар ва амбулатор шароитда даволанган. Муолажалари
          фойда бермагач юқоридаги шикоятлари билан “Соғлом турмуш” МЧЖ
          реаблитациялаш клиникасига даволаниш мақсадида келган.
        </div>
        <div>
          <div class="title">АNАМNЕSIS VIТАЕ</div>
          Оила шароити___қониқарли_ Маълумоти:
          <br />
          Специфик касалликлар. сил, гепатит___кузатилмаган_ <br />
          Аллергологик анамнез: Озиқ овқат ва дори-дармонларга ножўя таъсири
          кузатилмаган.
        </div>
        <div>
          <div class="title">Эпид анамнез</div>
          Бемор охирги 1 йил мобайнида юқумли касалликлар (тиф, паратиф,
          салмонеллёз, дизентерия ва бошқа ўткир инфекцион касалликлар, сил,
          вирусли гепатит, тери-таносил касалликлари) билан оғримаган. Юқоридаги
          касалликлар билан контактда бўлмаган
          <br />
          2. 1 хафтадан 2 ойгача яшаш жойидан ташқарига чиқмаган <br />
          3. Охирги 6 ой мобайнида стационар ва амбулатор шароитда даволанади
          <br />
          4. Қон ва ўрнини босувчи суюқликлар охирги 6 ойда қуюлмаган <br />
          5. Операция бўлмаган <br />
          6. Ўз яшаш жойида парентерал препаратлар олган нина терапия олмаган
          <br />
          7. Косметолог (маникюр, педикюр, персинг, татуаж) хизматидан
          фойдаланган <br />
          8. Гуридотерапия олмаган <br />
          9. Стоматология хизматидан фойдаланган
        </div>
        <div>
          <div class="title">SТАТUS РRАЕSЕNS ОВЕКTIYUS</div>
          Умумий ахволи: ўртача оғир, эси хуши аниқ. Беморнинг холати қониқарли
          Тана тузилиши нормастеник, Қадди тўғри. Тери нам, тоза:
          <br />
          Тошмалар: йўқ, Чандиқлар йўқ, Трофик ўзгаришлар: йўқ <br />
          Кўзга ташланувчи тошмалар: йўқ Шиллиқ қаватлар: одатдагидек. <br />
          Тери ости ёғ қатлами ривожланиши: меъёрида, Лимфа тугунлари
          катталашмаган <br />
          Мускуллар ривожланиши яхши, Тонуси: сақланган. <br />
          Суяклар: деформациясиз Бўғимлар: шишмаган бўғим харакати: чекланмаган
        </div>
        <div>
          <div class="title">НАФАС ОЛИШ ТИЗИМИ</div>
          Шикоятлар:______йўқ__
          <br />
          Кўздан кечиришда: бурундан нафас олиш: эркин, Нафас сони 1
          дақиқада_20_та меъёрида, <br />
          Кўкрак қафаси: цилиндрик, <br />
          Овоз дириллашлари: бир хилда, Перкуссия : аниқ ўпка товуши эшитилди
          <br />
          Плеврани ишқаланиш шовқини эшитилмади, <br />
          Крепитация эшитилмади Бронхофония: ўзгаришсиз,
        </div>
        <div>
          <div class="title">ЮРАК-ҚОН ТОМИР ТИЗИМИ</div>
          Шикоятлар:______ йўқ_____ Кўздан кечиришда: Юрак сохаси ўзгаришсиз
          Эпигастрал пульсация йўқ, юрак учи турткиси кўзга ташланмайди,
          Пальпация; юрак учи турткиси чапда V қовурға оралиғида Перкуссия:
          юракнинг нисбий бўғиқлик чегаралари қуйидагича: ўнгда тўш суяги ўнг
          қирғоғида юқоридан ___ III ___ қовурғалар оралиғида чапдан чап ўрта
          ўмров чизиғидан___0.5__ см ташқарида. Аускультация; Оханглар: ритмик,
          I оханг жарангдорлиги: ўзгармаган, II оханг жарангдорлиги: ўзгармаган,
          Шовқинлар: йўқ,Томир уриш сони 1 дақиқада _____ та, ўртача тарангликда
          ва тўлиқликда А/Б _______ мм сим. Уст. Га тенг. Бўйин веналар кўзга
          ташланмайди
        </div>
        <div>
          <div class="title">ОВҚАТ ХАЗМ ҚИЛИШ ТИЗИМИ</div>
          <br />
          Шикоятлар йўқ <br />
          Кўздан кечириш: тили нам, ранги-тоза, Қорин кўздан кечиришда
          __ўзгаришсиз Пайпастлашда: қорин: юмшоқ, оғриқсиз, Жигар чегараси:
          ўзгаришсиз <br />
          Талоқ чап қобурға остида катталашмаган, Ич келиши равон оғриқсиз.
        </div>
        <div>
          <div class="title">СИЙДИК АЖРАТИШ ТИЗИМИ</div>
          <br />
          Шикоятлар:__________йўқ____ <br />
          Кўздан кечиришда буйраклар сохаси: ўзгаришсиз <br />
          Пайпастлашда буйраклар сохасида оғриқ иккала томонда йўқ. Туккиллатиш:
          туккиллатиш белгиси иккала томонда манфий. Сийдик чиқариши: ўзгаришсиз
        </div>
        <div>
          <div class="title">
            ИЧКИ СЕКРЕЦИЯ БЕЗЛАРИ СИСТЕМАСИ
          </div>
          <br />
          Шикоятлар:______________йўқ______ <br />
          Қалқонсимон без: кўздан кечиришда нормал, <br />
          Ташқи жинсий аъзолари: ривожланиш _________ларга хос
        </div>
        <div>
          <div class="title">ДАСТЛАБКИ ТАШХИСНИ АСОСЛАШ</div>
          <br />
          ДАСТЛАБКИ ТАШХИСНИ АСОСЛАШ Б е м о р н и а н а м н е з и о б ь е к т и
          в т е к ш и р у в л а р и хамда МРТ, <br />
          УТТ ва ЭЭГ лабаратория хулосаларига асосан дастлабки ташхис қўйилди
        </div>
        <div>
          <div class="title">АСОСИЙ ДИАГНОЗ :</div>
          <br />
          АСОРАТИ:
        </div>
        <div>
          <div class="title">ТЕКШИРИШ РЕЖАСИ</div>
          <ul
            v-for="(item, index) in item.registration_inspection"
            :key="index"
          >
            <li>{{ item.inspection.inspector_category.name }}</li>
          </ul>
          <div>
            ДАВОЛАШ РЕЖАСИ:
            <table class="davolash_rejasi" border="1">
              <tr>
                <td>1</td>
                <td></td>
              </tr>
              <tr>
                <td>2</td>
                <td></td>
              </tr>
              <tr>
                <td>3</td>
                <td></td>
              </tr>
              <tr>
                <td>4</td>
                <td></td>
              </tr>
              <tr>
                <td>5</td>
                <td></td>
              </tr>
              <tr>
                <td>6</td>
                <td></td>
              </tr>
              <tr>
                <td>7</td>
                <td></td>
              </tr>
              <tr>
                <td>8</td>
                <td></td>
              </tr>
              <tr>
                <td>9</td>
                <td></td>
              </tr>
              <tr>
                <td>10</td>
                <td></td>
              </tr>
            </table>
          </div>
        </div>
        <div class="kundalik">
          <div class="title">
            Кундалик
          </div>
          <br />
          Беморнинг умумий ахволи ўртача оғирликда, хуши жойида, тери ва шиллиқ
          қаватлари одатдагидек. Нафас олиш равон, бурун орқали. Ўпкада
          везикуляр нафас. Юрак тонлари аниқ ритмик А/Б ________ мм сим.уст.га
          тенг. Пульс ____ та ўртача тарангликда ва тўлиқликда. Қорни юмшоқ
          оғриқсиз. Жигар ва талоқ катталашмаган. Ич келиши ва сийиш равон,
          оғриқсиз. <br />
          Бемор барча муолажаларни вақтида олди ва тунни тинч ўтказди. <br />
          Врач ______________. <br />
          ___________ <br />
          Беморнинг умумий ахволи ўртача оғирликда, хуши жойида, тери ва шиллиқ
          қаватлари одатдагидек. Нафас олиш равон, бурун орқали. Ўпкада
          везикуляр нафас. Юрак тонлари аниқ ритмик А/Б __________ мм сим.уст.га
          тенг. Пульс _____ та ўртача тарангликда ва тўлиқликда. Қорин юмшоқ,
          оғриқсиз. Жигар ва талоқ катталашмаган. Ич келиши ва сийиш равон,
          оғриқсиз. <br />
          Бемор барча муолажаларни вақтида олди. <br />
          Врач ______________.
        </div>
        <div class="klinik_tashxis">
          <div class="title">Клиник ташхисни асослаш</div>
          <div class="bemor">
            <div>Бемор: {{ item.patient.fullname }}</div>
            <div>Ёши: {{ item.patient.birthday | moment }} – йил</div>
          </div>
          <div class="shikoyat">
            Шикоятлари: Бемор
            <div v-html="item.complaint"></div>
            тез асабийлашишига, умумий қувватсизликка шикоят қилади.
          </div>
          Анамнезидан: Бемор ўзини _______йилдан бери хаста хисоблайди. Ўз
          хасталигини сабабини хеч нарса билан боғламайди.
          <div class="obektiv">
            Обектив: Умумий аҳволи: қониқарли, Ҳолати фаол, Эс-ҳуши: аниқ,
            <br />
            Териси ва шиллиқ қаватлари: ранги одатдагидек тошмалар: йўқ <br />
            Тери ости ёғ қаватлари: қалинлиги нормада <br />
            Мушак системаси : (мушаклар тонуси ва кучи) нормада. <br />
            Суяк системаси: деформациясиз <br />
            Периферик лимфа тугунлари: катталашмаган <br />
            Нафас олиш системаси: нафас олиш равон, бурун орқали <br />
            Юрак-қон томир системаси: (уйқу артерияси пулсацияси, юрак чўққиси)
            нормада Аускултацияси: тон лари аниқ, ритмик <br />
            артериал қон босими : ______мм. сим. уст. тенг <br />
            Овқат ҳазм қилиш системаси: оғиз бўшлиғи тоза Қорин: палпацияда
            юмшоқ оғриқсиз Жигар ва талоқ катталашмаган. Ич келиши ва сийиш
            равон, оғриқсиз.
          </div>
        </div>
        Tekshiruv
        <ul
          class="tekshiruv"
          v-for="(item, index) in item.registration_inspection"
          :key="index"
        >
          <li>{{ item.inspection.inspector_category.name }}</li>
        </ul>
        <div
          class="klinik_tashxis"
          v-for="(doctor, index) in item.registration_doctor"
          :key="index"
        >
          Клиник ташхис:
          <br />
          ДАВОЛОВЧИ ВРАЧ {{ doctor.doctor.name }}
          <div>
            ____________
            <br />
            Беморнинг умумий ахволи қониқарли, хуши жойида, тери ва шиллиқ
            қаватлари одатдагидек. Нафас олиш равон, бурун орқали. Ўпкада
            везикуляр нафас. Юрак тонлари аниқ ритмик А/Б _______ мм сим.уст.га
            тенг. Пульс ______ та ўртача тарангликда ва тўлиқликда. Қорин юмшоқ,
            оғриқсиз. Жигар ва талоқ катталашмаган. Ич келиши қабзият билан,
            <br />
            Беморнинг умумий сийиш равон, оғриқсиз. <br />
            Бемор барча муолажаларни вақтида олди ва тунни тинч ўтказди
          </div>
          <div>
            <br />
            08.05.2021 <br />
            Беморнинг умумий ахволи ўртача оғирликда, хуши жойида, тери ва
            шиллиқ қаватлари одатдагидек. Нафас олиш равон, бурун орқали. Ўпкада
            везикуляр нафас. Юрак тонлари аниқ ритмик А/Б 100/70 мм сим.уст.га
            тенг. Пульс 75 та ўртача тарангликда ва тўлиқликда. Қорни юмшоқ
            оғриқсиз. Жигар ва талоқ катталашмаган. Ич келиши ва сийиш равон,
            оғриқсиз. <br />
            Бемор барча муолажаларни вақтида олди ва тунни тинч ўтказди. <br />
            Врач ______________
          </div>
          <div>
            <br />
            09.05.2021 <br />
            Беморнинг умумий ахволи қониқарли, хуши жойида, тери ва шиллиқ
            қаватлари одатдагидек. Нафас олиш равон, бурун орқали. Ўпкада
            везикуляр нафас. Юрак тонлари аниқ ритмик А/Б 110/80 мм сим.уст.га
            тенг. Пульс 76 та ўртача тарангликда ва тўлиқликда. Қорин юмшоқ,
            оғриқсиз. Жигар ва талоқ катталашмаган. Ич келиши қабзият билан,
            сийиш равон, оғриқсиз. <br />
            Бемор барча муолажаларни вақтида олди ва тунни тинч ўтказди. <br />
            Врач ______________.
          </div>
          <div>
            <br />
            10.05.2021 <br />
            Беморнинг умумий ахволи қониқарли, хуши жойида, тери ва шиллиқ
            қаватлари одатдагидек. Нафас олиш равон, бурун орқали. Ўпкада
            везикуляр нафас. Юрак тонлари аниқ ритмик А/Б 110/70 мм сим.уст.га
            тенг. Пульс 79 та ўртача тарангликда ва тўлиқликда. Қорин юмшоқ,
            оғриқсиз. Жигар ва талоқ катталашмаган. Ич келиши қабзият билан,
            <br />
            Беморнинг умумий сийиш равон, оғриқсиз. <br />
            Бемор барча муолажаларни вақтида олди ва тунни тинч ўтказди. <br />
            Врач ______________.
          </div>
          <div>
            <br />
            11.05.2021 <br />
            Беморнинг умумий ахволи ўртача оғирликда, хуши жойида, тери ва
            шиллиқ қаватлари одатдагидек. Нафас олиш равон, бурун орқали. Ўпкада
            везикуляр нафас. Юрак тонлари аниқ ритмик А/Б 110/80 мм сим.уст.га
            тенг. Пульс 78 та ўртача тарангликда ва тўлиқликда. Қорни юмшоқ
            оғриқсиз. Жигар ва талоқ катталашмаган. Ич келиши ва сийиш равон,
            оғриқсиз. <br />
            Бемор барча муолажаларни вақтида олди ва тунни тинч ўтказди. <br />
            Врач ______________.
          </div>
        </div>
        <div class="eskiz">
          <div class="title">ЧИҚАРИШ ЭПИКРИЗИ №</div>
          <div class="malumots">
            <div>Бемор: {{ item.patient.name }}</div>
            <div>Ёши: {{ item.patient.birthday | moment }} – йил;</div>
          </div>
          <br />
          Турар жойи: {{ item.patient.region.name }} <br />
          ________-йил « _________ » дан « ______________ йил » гача неврология
          бўлимида даволанди
          <div
            v-for="(items, index) in item.registration_inspection"
            :key="index"
          >
            <div
              v-for="(child, index) in items.registration_inspection_child"
              :key="index"
            >
              Ташхис:
              <div v-html="child.text"></div>
            </div>
          </div>
          <br />
          Беморнинг келгандаги шикоятлари: Бемор
          <div v-html="item.complaint"></div>
          умумий қувватсизликка шикоят қилади. <br />
          Анамнезидан: Бемор ўзини ____________ йилдан бери хаста хисоблайди. Ўз
          хасталигини сабабини хеч нарса билан боғламайди. <br />
          Холати: Умумий аҳволи: қониқарли, Ҳолати фаол, Эс-ҳуши: аниқ, <br />
          Териси ва шиллиқ қаватлари: ранги одатдагидек тошмалар: йўқ <br />
          Тери ости ёғ қаватлари: қалинлиги нормада <br />
          Мушак системаси : (мушаклар тонуси ва кучи) нормада. <br />
          Суяк системаси: деформациясиз <br />
          Периферик лимфа тугунлари: катталашмаган <br />
          Нафас олиш системаси: нафас олиш равон, бурун орқали <br />
          Юрак-қон томир системаси: (уйқу артерияси пулсацияси, юрак чўққиси)
          нормада Аускултацияси: тон лари аниқ, ритмик <br />
          артериал қон босими : __________мм. сим. уст. тенг <br />
          Овқат ҳазм қилиш системаси: оғиз бўшлиғи тоза Қорин: палпацияда юмшоқ
          оғриқсиз Жигар ва талоқ катталашмаган. Ич келиши ва сийиш равон,
          оғриқсиз.
          <br />
          <br />
          <br />
          Даволаш муолажаларини вақтида олган: Беморнинг умумий ахволи нисбатан
          яхшиланганлиги учун уйига рухсат берилди <br />
          Тавсиялар: 1)Дориларини ўз вақтида ичиб туриш <br />
          Бўлим бошлиги: Жалилов Ш. Х.
        </div>
      </div>
      <div class="malumot" v-else>
        <div class="bosh">
          <b-icon icon="info-circle-fill"></b-icon>
          <div>Malumot mavjud emas</div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import moment from "moment";
export default {
  data() {
    return {
      data: []
    };
  },
  created: function() {
    this.data.push(JSON.parse(localStorage.getItem("History")));
    setTimeout(() => {
      window.print();
    }, 2000);
  },
  filters: {
    moment: function(date) {
      if (date != null) {
        return moment.unix(date).format("DD.MM.YYYY");
      } else {
        return "";
      }
    }
  }
};
</script>

<style scope>
.malumot {
  width: 100%;
  height: 100vh;
  display: flex;
  justify-content: center;
  align-items: center;
}
.bosh {
  width: 500px;
  height: 200px;
  background: linear-gradient(
    to left,
    rgb(172, 171, 171),
    rgb(240, 239, 239),
    rgb(172, 171, 171)
  );
  border-radius: 5px;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
}
.history {
  width: 80%;
  margin: 0 auto;
}
.title {
  text-align: center;
}
.titles {
  font-size: 30px;
  text-align: center;
  font-weight: bolder;
  margin: 20px 0px 40px 0px;
}
.header {
  display: flex;
  justify-content: space-between;
  align-items: center;
}
.box {
  width: 100%;
  height: 250px;
  padding: 10px;
  text-align: center;
  border: 2px solid black;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
}
.box img {
  width: 300px;
}
.davolash_rejasi tr td:nth-child(1) {
  width: 20px;
}
.davolash_rejasi tr td:nth-child(2) {
  width: 300px;
}
</style>
