<template>
  <div class="shartnoma">
    <div class="shartnoma1">
      <div class="header">
        <div class="header1">
          «SOG’LOM TURMUSH» МА’SULIYATI СHEKLANGAN JAMIYATI
        </div>
        <div class="header1">
          ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ <br />
          «СОГЛОМ ТУРМУШ»
        </div>
      </div>
      <div class="title" style="padding-top: 20px">
        ХИСОБ-ШАРТНОМА №
        <input
          style="width: 50px; border: none;"
          type="text"
          class="back"
          placeholder="Hisob raqam"
        />
      </div>
      <div class="manzil">
        <div class="left">
          <input
            type="text"
            class="back"
            style="border: none;"
            placeholder="sana"
          />
          йил.
        </div>
        <div>Андижон шахар.</div>
      </div>
      <div>
        Устав асосида иш юритувчи Андижон шахар «Соғлом турмуш» маъсулияти
        чекланган жамияти раиси Жалилов.Ш. Х. бир томондан, иккинчи томондан
        келгусида даволанувчи «МИЖОЗ»
        <input
          type="text"
          class="back"
          style="border: none;"
          placeholder="Mijoz"
        />, учинчи томондан даволанувчи беморга молиявий ёрдам кўрсатувчи «ХОМИЙ
        ТАШКИЛОТ» «
        <input
          type="text"
          class="back"
          style="border: none"
          placeholder="Homiy tashkilot"
        />
        томондан ушбу шартномани туздилар:
      </div>
      <div class="content">
        <div class="title">1.ШАРТНОМА МАЗМУНИ.</div>
        <div class="div">
          1.1 «Соғлом турмуш» МЧЖ «МИЖОЗ» га яъни {{ data.name }} га хамма
          қулайликларга эга бўлган, 10 кун давомида ётиб даволаниш учун хона
          ажратади ва тиббий стационар хизматларини замонавий тиббий аппаратура
          мосламалари ёрдамида аниқ диогностика кўйиб, олий ва дунё стандарти
          асосида даволайди хамда уч махал иссик овкат билан таъминлайди. <br />
          1.2 «МИЖОЗ» ётиб даьволаниши учун биринчи қаторда бухгалтерия
          хужжатлари (шартнома, хисоб фактураси) ва бошқа расмий хужжатларни
          тўлдиради.Шундан сўнг тиббий стационар даволаш хизмат хаққини,
          шартномада келишилган нархда, шартнома имзоланган кундан бошлаб 3 (уч)
          кун мобайнида «Хомий ташкилот» томонидан (100 фоиз) олдиндан пул
          ўтказиш йўли билан ёки нақд пул тўлашни амалга оширади.

          <br />
          <div class="title">2. НАРХ ВА ХИСОБ КИТОБ ТАРТИБИ.</div>
          <br />
          2.1 «ХОМИЙ ТАШКИЛОТ» шартномада келишилган нархда яъни
          <input
            type="text"
            class="back"
            style="border: none;"
            placeholder="summa"
          />
          сўмни (100фоиз) олдиндан пул ўтказиш йўли билан ёки накд пул тўлаш
          йули билан амалга оширади. <br />
          2.2 «ХОМИЙ ТАШКИЛОТ» шартнома тузилган кундан бошлаб 3 (уч) банк
          кунида «Соғлом турмуш» клиникасининг УзМиллийбанк Андижон булими МФО
          00074, СТИР 203613961, ОКОНХ 91514, 20208000904261809001 хисоб
          рақамига ўтказиб беради.

          <br />
          <div class="title">3. ТОМОНЛАРНИНГ МАЖБУРИЯТЛАРИ</div>
          <br />
          <div class="title">
            3.1 «Соғлом турмуш» маъсулияти чекланган жамияти
          </div>
          <br />
          3.1.1 «Мижоз» ни яъни беморни, «Соглом Турмуш» МЧЖ хисоб рақамига пул
          тушгандан сўнг даволаш учун қабул қилиб олади. <br />
          3.1.2 «Мижоз» ни яъни беморни ташхисини аниқлаштириб юқори даражада
          олий малакали шифокорлар билан биргаликда унумли ва сифатли даволайди.
          <br />
          3.1.3 «Мижоз» учун барча шарт шароитлар ва кулайликлар яратиб беради.
          <br />
          3.1.4 «Мижоз» ни ўз хисобидан олиб келинган озиқ-овқат махсулотини
          пишириб истемол қилиши учун барча шарт-шароитлар ва қулайликлар яратиб
          беради. <br />
          3.1.5 «Мижоз» ни даволаниши даврида кўрсатиб ўтилган дори дармонларни,
          бемор истемол қилмаса хамда врач томонидан кўрсатиб ўтилган йўриқларни
          бажармаса «Соғлом турмуш» реабилитациялаш клиникаси ўз жавобгарлигидан
          мустасно бўлади. <br />
          3.1.6 «Мижоз» яьни бемор «Соғлом турмуш» клиникасида даволаниб
          бўлгандан сўнг, врач томонидан кўрсатиб ўтилган кейинги даврлар
          давомида бемор истемол қилиб туриш учун ёзиб берган дори-дармонларни
          ўз вақтида истемол қилмай кўйса, хамда врач кўрсатиб ўтилган кун
          давомида келиб врач кўригидан ўтилмаса «Соғлом турмуш» ребилитациялаш
          клиникаси кейинги даврлар учун хеч қандай арз шикоятларни ўз бўйнига
          олмайди ва жавобгарликдан умуман мустасно бўлади.

          <br />
          <div class="title">3.2 «МИЖОЗ»</div>
          <br />
          3.2.1 «ХОМИЙ ТАШКИЛОТ» «Соғлом турмуш» клиникаси хисоб рақамига пул
          туширганидан сўнг «Мижоз» га тиббий хизмат курсатишни бошлайди. <br />
          3.2.2 «Мижоз» клиниканинг ички ва ташқи интизомига қатьий риоя қилади.
          <br />
          3.2.3 «Мижоз» озодаликни хамда тинчликни сақлайди.

          <br />
          <div class="title">4.Коррупцияга карши келишув</div>

          <br />
          4.1 Шартнома бўйича ўз мажбуриятларинини бажаришда Томонлар
          коррупцияга қарши курашиш бўйича қоидаларга, шу жумладан амалдаги
          қонунларга риоя этилишини таъминлайди; яъни улар, уларнинг ходимлари,
          аффилланган шахслар, бенефициари ва шартномани амалга оширишдаги
          хамкорлари, пудратчилари томонидан бир-бирига ёки давлат иштирокидаги
          ташкилот ходимига пора бериш ёки пора беришда воситачилик қилишда,
          моддий ёки номоддий наф олишдан тийилиши лозим. Томонлар ушбу
          харакатларнинг олдини олиш бўйича чора-тадбирлар қабул қилинишини
          кафолатлайди. <br />
          Томонлар коррупцияга қарши қоидалар бузулганда ёки асосли гумонлар
          юзага келганида дархол ёзма равишда (электрон почта орқали) ёки ишонч
          телефони (78 150 26 03) орқали бир-бирини хабардор қилиш мажбуриятини
          олади. Бунда томонлар юзага келган холатга ойдинлик киритиш мақсадида
          ёзма изох талаб қилиш хуқуқига эга ва мурожаатини олган томон 10 (ўн)
          иш куни мобайнида тушинтириш бериши ёки ўз фикрини билдириши мумкин.
          <br />
          Мазкур бобнинг талаблари бажарилмаганда, шу жумладан белгиланган
          муддатда коррупцион хавф-хатар бартараф этилмаса, томонлар амалга
          оширган чоралар коррупцион холатни пасайишига олиб келмаса, бошқа
          томон шартномани бекор қилиш хуқуқига эга ёки унинг ижросини тўхтатиб
          қўйиши мумкин. <br />
          Ушбу бобда кўрсатилган асослар бўйича шартномани бир томонлама бекор
          қилиш талаб қилган томонга етказилган зарарларни қоплаш қонунчиликда
          кўрсатилган тартибда амалга оширилади, ушбу бобнинг мажбуриятларини
          бузган томон эса шартноманинг бир томонлама бекор қилиниши оқибатида
          кўрилган зарарлар қоплашни талаб қилишига хақли эмас. <br />
          Томонлар шартнома бўйича ўз мажбуриятларини бажараётганда Ўзбекистон
          Республикасининг коррупцияга қарши курашиши тўғрисидаги қонун
          хужжатларининг талабларига зид келадиган ҳар қандай ҳаракатларни
          амалга оширмайдилар, шу жумладан пора, яъни (давлат органи ёки
          ташкилотнинг номи) ходими ўз хизмат мажбуриятларидан фойдаланган ҳолда
          пора берган шахснинг манфаатларини кўзлаб муаян ҳаракатларни содир
          етиш ёки содир етмаслиги шартлиги ёҳуд мумкинлиги учун моддий
          қийматликларни ёки мулкий наф олиш учун қуйидаги ҳаракатларни
          қилмайди: <br />
          Пора беришни таклиф қилиш ёки ваъда бериш; <br />
          Товламачилик қилиш; <br />
          Пора сифатида пул тўлаш; <br />
          Бевосита ёки билвосита пора олишга розилик бериш томонлар ушбу
          ҳаракатларга йўл <br />
          қўймаслик бўйича чоралар кўрилишига кафолат беради.
          <div class="title">
            5. ФОРС МАЖОР
          </div>
          <br />
          5.1 Томонлар шартнома буйича уз мажбурурятларини бажармаганлик ёки
          лозим даражада бажармаганлик учун жавобгарликдан озод килинадилар ,
          агар бу форс-мажор холатлари (табиий офат, фукаролик ёки такикловчи
          хал килув актларининг харакати) натижасида юзага келган булса.

          <br />
          <div class="title">6. ШАРТНОМА АМАЛ КИЛИШ МУДДАТИ.</div>
          <br />
          6.1 Шартнома уч нусхада тузилган бўлиб, хар бир нусха алохида юридик
          кучга эга бўлади. Шартнома хар учала томонда бир нусхадан сақланади.
          Шартноманинг амал қилиш муддати:
          <input
            type="text"
            class="back"
            style="border: none"
            placeholder="sana"
          />йилдан
          <input
            type="text"
            class="back"
            style="border: none"
            placeholder="sana"
          />
          йилгача белгиланди.
          <div class="title">7. ТОМОНЛАРНИНГ МАНЗИЛГОХИ.</div>
          <br />
          «СОҒЛОМ ТУРМУШ» <br />
          Маъсулияти чекланган жамияти <br />
          Андижон шахар <br />
          Миллий Тикланиш кўчаси берк № 27 уй <br />
          Телефон: (+99893) 690-07-57 <br />
          Х/р: 20208000904261809001 <br />
          УзМиллийбанк Андижон булими <br />
          МФО: 00074 <br />
          ИНН: 203613961 <br />
          МЧЖ раиси: ____________ Ш.Жалилов
          <div class="footer">
            <div class="footer1">
              «ХОМИЙ ТАШКИЛОТ» <br />
              <p>__________________________________________________________</p>
              <p>__________________________________________________________</p>
              <p>__________________________________________________________</p>
              <p>__________________________________________________________</p>
              <p>__________________________________________________________</p>
            </div>
            <div class="footer1">
              «МИЖОЗ» <br />
              <p>__________________________________________________________</p>
              <p>__________________________________________________________</p>
              <p>__________________________________________________________</p>
              <p>__________________________________________________________</p>
              <p>__________________________________________________________</p>
            </div>
          </div>
        </div>
      </div>
    </div>
    <!-- <div class="shartnoma2">
        <div class="header">
        <div class="header1">
            «SOG’LOM  TURMUSH» МА’SULIYATI СHEKLANGAN JAMIYATI 
        </div>
        <div class="header1">
            ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ <br> «СОГЛОМ  ТУРМУШ»
        </div>
     </div>
        <div class="title" style="padding-top: 20px">ХИСОБ-ШАРТНОМА № <input style="width: 50px; border: none;" type="text" class="back" placeholder="Hisob raqam"> </div>
     <div class="manzil">
        <div class="left"><input type="text" class="back" style="border: none;" placeholder="sana"> йил.</div>
        <div>Андижон  шахар. </div>
     </div>
     <div>
        Устав асосида иш юритувчи Андижон шахар «Соғлом турмуш» маъсулияти чекланган жамияти раиси Жалилов.Ш. Х. 
        бир томондан, иккинчи томондан келгусида даволанувчи «МИЖОЗ» <input type="text" class="back" style="border: none;" placeholder="Mijoz">, учинчи томондан  даволанувчи беморга молиявий ёрдам кўрсатувчи «ХОМИЙ ТАШКИЛОТ» « <input type="text" class="back" style="border: none" placeholder="Homiy tashkilot"> томондан ушбу шартномани туздилар:
   </div>
   <div class="content">
    
    <div class="title">1.ШАРТНОМА МАЗМУНИ.</div>
  <br> 1.3	«Соғлом турмуш» МЧЖ «МИЖОЗ» га яъни <input type="text" class="back" style="border: none" placeholder="Mijoz"> га хамма қулайликларга эга бўлган, 10 кун давомида ётиб даволаниш учун хона ажратади ва тиббий стационар хизматларини замонавий тиббий аппаратура мосламалари ёрдамида аниқ диогностика кўйиб, олий ва дунё стандарти асосида даволайди хамда уч махал иссик овкат билан таъминлайди. 
  <br> 1.4	«МИЖОЗ» ётиб даьволаниши учун биринчи қаторда бухгалтерия хужжатлари (шартнома, хисоб фактураси) ва бошқа расмий хужжатларни тўлдиради.Шундан сўнг тиббий стационар даволаш хизмат хаққини, шартномада келишилган нархда, «Хомий ташкилот» томонидан  олдиндан пул ўтказиш йўли билан ёки нақд пул тўлашни амалга оширади.
   
  <br> 2. НАРХ ВА ХИСОБ КИТОБ ТАРТИБИ.
  <br> 2.1 «ХОМИЙ ТАШКИЛОТ» шартномада келишилган нархда яъни <input type="text" class="back" style="border: none;" placeholder="summa"> сўмни олдиндан 30% ва даволангандан кейин  70% туловни  пул ўтказиш йўли билан ёки накд пул билан 
  <br>  амалга оширади.
  <br> 2.2 «ХОМИЙ ТАШКИЛОТ» шартнома тузилган кундан бошлаб 3 (уч) банк кунида «Соғлом турмуш» клиникасининг УзМиллийбанк Андижон булими МФО 00074, СТИР 203613961, ОКОНХ 91514, 20208000904261809001 хисоб рақамига ўтказиб беради.
   
  <br> <div class="title">3. ТОМОНЛАРНИНГ МАЖБУРИЯТЛАРИ</div>
  <br>  3.1 «Соғлом турмуш» маъсулияти чекланган жамияти
  <br>  3.1.1 «Мижоз» ни яъни беморни, «Соглом Турмуш» МЧЖ хисоб рақамига пул тушгандан сўнг даволаш учун қабул қилиб олади.
   <div class="header">
        <div class="header1">
            «SOG’LOM  TURMUSH» МА’SULIYATI СHEKLANGAN JAMIYATI 
        </div>
        <div class="header1">
            ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ <br> «СОГЛОМ  ТУРМУШ»
        </div>
     </div> 
     <div>
        Устав асосида иш юритувчи Андижон шахар «Соғлом турмуш» маъсулияти чекланган жамияти раиси Жалилов.Ш бир томондан, келгусида даволанувчи бемор ёки даволанувчи беморга молиявий ёрдам кўрсатувчи хомий корхона ёки ташкилот рахбари «Мижоз» деб номланувчи
        <input type="text" class="back"  style="border: none;" placeholder="Tashkilot nomi">
            иккинчи томондан, ушбу шартномани туздилар;
     </div>
   <div class="title">1.ШАРТНОМА МАЗМУНИ.</div>
   
 <br>  1.5	«Соғлом турмуш» МЧЖ «Мижоз» га яъни
 <input type="text" class="back" style="border: none;" placeholder="Mijoz">
   хамма қулайликларга эга бўлган, ётиб даволаниш учун хона ажратади ва тиббий стационар хизматларини замонавий тиббий аппаратура мосламалари ёрдамида аниқ диогностика кўйиб, олий ва дунё стандарти асосида даволайди.
  <br> 1.6	«Мижоз» ётиб даьволаниши учун биринчи қаторда бухгалтерия хужжатлари (шартнома, хисоб фактураси) ва бошқа расмий хужжатларни тўлдиради.Шундан сўнг тиббий стационар даволаш хизмат хаққини, шартномада келишилган нархда, шартнома имзоланган кундан бошлаб 3 (уч) кун мобайнида (100 фоиз) олдиндан пул ўтказиш йўли билан ёки нақд пул тўлашни амалга оширади.
   
  <div class="title"> 2. НАРХ ВА ХИСОБ КИТОБ ТАРТИБИ.</div>
   
  <br> 2.1 «Мижоз» шартномада келишилган нархда яъни <input type="text" class="back" style="border: none;" placeholder="summa">
сўмни  (100 фоиз) олдиндан пул ўтказиш йўли билан ёки накд пул тўлашни хафтанинг 3 (учинчи) кунига қолмай амалга оширади.
  <br> 2.2 «Мижоз» шартнома тузилган кундан бошлаб 3 (уч) банк кунида «Соғлом турмуш» клиникасининг УзМиллийбанк Андижон булими МФО 00074, СТИР 203613961, ОКОНХ 91514, 20208000904261809001 хисоб рақамига ўтказиб беради.
   
   <div class="title">3. ТОМОНЛАРНИНГ МАЖБУРИЯТЛАРИ</div>
   
  <br> 3.1 «Соғлом турмуш» маъсулияти чекланган жамияти
   
 <br>  3.1.1 «Мижоз»ни яъни беморни, хисоб рақамига пул тушгандан сўнг клиникага даволаниши учун қабул қилиб олади.
 <br>  3.1.2  «Мижоз»ни яъни беморни ташхисини аниқлаштириб юқори даражада олий малакали шифокорлар  билан биргаликда унумли ва сифатли даволайди.
  <br> 3.1.3 Бемор учун барча шарт шароитлар ва кулайликлар яратиб беради.
 <br>  3.1.4 Беморни ўз шахсий пулига дорихонадан арзон ва сифатли дори дармонларни олиб келиш хизмат мажбуриятини олади.
  <br> 3.1.5 «Мижоз»ни  ўз хисобидан олиб келинган озиқ-овқат махсулотини пишириб истемол қилиши учун барча шарт-шароитлар ва қулайликлар яратиб беради.
 <br>  3.1.6 «Мижоз»ни даволаниши даврида кўрсатиб ўтилган дори дармонларни, бемор истемол қилмаса хамда врач томонидан кўрсатиб ўтилган йўриқларни бажармаса «Соғлом турмуш» реабилитациялаш клиникаси ўз жавобгарлигидан мустасно бўлади.
 <br>  3.1.7 «Мижоз» яьни бемор «Соғлом турмуш» клиникасида даволаниб бўлгандан сўнг, врач томонидан кўрсатиб ўтилган  кейинги даврлар давомида бемор  истемол қилиб туриш учун ёзиб берган дори-дармонларни ўз вақтида истемол қилмай кўйса, хамда врач кўрсатиб ўтилган кун давомида келиб врач кўригидан ўтилмаса «Соғлом турмуш» ребилитациялаш клиникаси кейинги даврлар учун хеч қандай арз шикоятларни ўз бўйнига олмайди ва жавобгарликдан умуман мустасно бўлади.
   
  <br> <div class="title">3.2 «Мижоз»</div>
   
  <br> 3.2.1  «Мижоз» яьни бемор «Соғлом турмуш» клиникаси хисоб   рақамига пул туширганидан сўнг даволаниш курсига келади.
  <br> 3.2.2  «Мижоз» клиниканинг ички ва ташқи интизомига қатьий риоя қилади.
 <br>  3.2.3 «Мижоз» озодаликни хамда тинчликни сақлайди.
  <br> 3.2.4 «Мижоз» доимий овқатланиши учун озиқ-овқатни ўз хисобидан олиб келади.
   
  <div class="title"> 4. ШАРТНОМА  АМАЛ  КИЛИШ  МУДДАТИ</div>.
   
  <br> 4.1 Шартнома икки нусхада тузилган бўлиб, хар бир нусха алохида юридик кучга эга бўлади.
         Шартнома хар иккала  томонда бир нусхадан сақланади. Шартноманинг амал қилиш 
         муддати.
   
     <br>    <input type="text" class="back" style="border: none;" placeholder="sana"> йилдан
        
      <br>   <input type="text" class="back" style="border: none;" placeholder="sana"> йилгача белгиланди.
   
   
   <div class="title">5. ТОМОНЛАРНИНГ МАНЗИЛГОХИ.</div>
   
   
  <div class="footer">
    <div class="footer1">
        <br> «Соғлом турмуш»                      
  <br> Маъсулияти чекланган жамияти
  <br> Андижон шахар                                              
  <br> Миллий Тикланиш кўчаси берк № 27  уй             
 <br>  Телефон: (+99893) 690-07-57   
  <br> Х/р: 20208000904261809001   
  <br> УзМиллийбанк Андижон булими            
 <br>  МФО: 00074     
  <br> ИНН: 203613961               
   
   МЧЖ раиси:   Ш.Жалилов
      имзо    ф.и.ш
    </div>
    <div class="footer1">
        «МИЖОЗ» <br>
        <textarea style="border: none; resize:none;width: 500px;height:200px" name="" id="" cols="30" rows="1">__</textarea><br>
    </div>
  </div>
   </div>
   
   
   <div class="header">
        <div class="header1">
            «SOG’LOM  TURMUSH» МА’SULIYATI СHEKLANGAN JAMIYATI 
        </div>
        <div class="header1">
            ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ <br> «СОГЛОМ  ТУРМУШ»
        </div>
     </div>
        <div class="title" style="padding-top: 20px">ХИСОБ-ШАРТНОМА № <input style="width: 50px; border: none;" type="text" class="back" placeholder="Hisob raqam"> </div>
     <div class="manzil">
        <div class="left"><input type="text" class="back" style="border: none;" placeholder="sana"> йил.</div>
        <div>Андижон  шахар. </div>
     </div>
   <div class="content">
   <div class="title"> 1.ШАРТНОМА МАЗМУНИ.</div>
  <br> 1.7	«Соғлом турмуш» МЧЖ «МИЖОЗ» га яъни <input type="text" class="back" style="border: none;" placeholder="Mijoz">га хамма қулайликларга эга бўлган, 10 кун давомида ётиб даволаниш учун хона ажратади ва тиббий стационар хизматларини замонавий тиббий аппаратура мосламалари ёрдамида аниқ диогностика кўйиб, олий ва дунё стандарти асосида даволайди хамда уч махал иссик овкат билан таъминлайди. 
  <br> 1.8	«МИЖОЗ» ётиб даьволаниши учун биринчи қаторда бухгалтерия хужжатлари (шартнома, хисоб фактураси) ва бошқа расмий хужжатларни тўлдиради.Шундан сўнг тиббий стационар даволаш хизмат хаққини, шартномада келишилган нархда, шартнома имзоланган кундан бошлаб 3 (уч) кун мобайнида «Хомий ташкилот» томонидан (100 фоиз) олдиндан пул ўтказиш йўли билан ёки нақд пул тўлашни амалга оширади.
   
  <br> 2. НАРХ ВА ХИСОБ КИТОБ ТАРТИБИ.
  <br> 2.1 «ХОМИЙ ТАШКИЛОТ» шартномада келишилган нархда яъни <input type="text" class="back" style="border: none" placeholder="summa"> сўмни  (100 фоиз) олдиндан пул ўтказиш йўли билан ёки накд пул тўлаш йули билан амалга оширади.
  <br> 2.2 «ХОМИЙ ТАШКИЛОТ» шартнома тузилган кундан бошлаб 3 (уч) банк кунида «Соғлом турмуш» клиникасининг УзМиллийбанк Андижон булими МФО 00074, СТИР 203613961, ОКОНХ 91514, 20208000904261809001 хисоб рақамига ўтказиб беради.
   
  <div class="title"> 3. ТОМОНЛАРНИНГ МАЖБУРИЯТЛАРИ</div>
  <br> 3.1 «Соғлом турмуш» маъсулияти чекланган жамияти
  <br> 3.1.1 «Мижоз» ни яъни беморни, «С оглом Турмуш» МЧЖ хисоб рақамига пул тушгандан сўнг даволаш учун қабул қилиб олади.
  <br> 3.1.2  «Мижоз» ни яъни беморни ташхисини аниқлаштириб юқори даражада олий малакали шифокорлар  билан биргаликда унумли ва сифатли даволайди.
  <br> 3.1.3 «Мижоз» учун барча шарт шароитлар ва кулайликлар яратиб беради.
  <br> 3.1.4 «Мижоз» ни  ўз хисобидан олиб келинган озиқ-овқат махсулотини пишириб истемол қилиши учун барча шарт-шароитлар ва қулайликлар яратиб беради.
  <br>  3.1.5 «Мижоз» ни даволаниши даврида кўрсатиб ўтилган дори дармонларни, бемор истемол қилмаса хамда врач томонидан кўрсатиб ўтилган йўриқларни бажармаса «Соғлом турмуш» реабилитациялаш клиникаси ўз жавобгарлигидан мустасно бўлади.
  <br> 3.1.6 «Мижоз» яьни бемор «Соғлом турмуш» клиникасида даволаниб бўлгандан сўнг, врач томонидан кўрсатиб ўтилган  кейинги даврлар давомида бемор  истемол қилиб туриш учун ёзиб берган дори-дармонларни ўз вақтида истемол қилмай кўйса, хамда врач кўрсатиб ўтилган кун давомида келиб врач кўригидан ўтилмаса «Соғлом турмуш» ребилитациялаш клиникаси кейинги даврлар учун хеч қандай арз шикоятларни ўз бўйнига олмайди ва жавобгарликдан умуман мустасно бўлади.
   
   <div class="title">3.2 «МИЖОЗ»</div>
   <br> 3.2.1  «ХОМИЙ ТАШКИЛОТ» «Соғлом турмуш» клиникаси хисоб   рақамига пул туширганидан сўнг «Мижоз» га тиббий хизмат курсатишни бошлайди. 
   <br> 3.2.2  «Мижоз» клиниканинг ички ва ташқи интизомига қатьий риоя қилади.
   <br> 3.2.3 «Мижоз» озодаликни хамда тинчликни сақлайди.
   
   <div class="title">4. ШАРТНОМА  АМАЛ  КИЛИШ  МУДДАТИ.</div>
   <br>  4.1 Шартнома уч нусхада тузилган бўлиб, хар бир нусха алохида юридик кучга эга бўлади.
   <br>       Шартнома хар учала  томонда бир нусхадан сақланади. Шартноманинг амал қилиш 
   <br>      муддати: 
   <br>    <input type="text" class="back" style="border: none;" placeholder="sana">йилдан
   <br>     <input type="text" class="back" style="border: none;" placeholder="sana"> йилгача белгиланди.
   
   <div class="title">5. ТОМОНЛАРНИНГ МАНЗИЛГОХИ.</div>
   
   <br> «СОҒЛОМ ТУРМУШ»
   <br> Маъсулияти чекланган жамияти
   
   <br> Андижон шахар
   <br>Миллий Тикланиш кўчаси берк № 27  уй
   <br>Телефон: (+99893) 690-07-57
   <br>Х/р: 20208000904261809001
   <br> УзМиллийбанк Андижон булими
   <br> МФО: 00074
   <br> ИНН: 203613961
   <br> МЧЖ раиси: ____________ Ш.Жалилов
   <div class="footer">
    <div class="footer1">
        «ХОМИЙ ТАШКИЛОТ» <br>
        <textarea style="border: none; resize:none;width: 500px;height:200px" name="" id="" cols="30" rows="1">__</textarea><br>
    </div>
      <div class="footer1">
        «МИЖОЗ» <br>
        <textarea style="border: none; resize:none;width: 500px;height:200px" name="" id="" cols="30" rows="1">__</textarea><br>
    </div>
   </div>
   </div>
    </div> -->
    <div @click="ChopEtish" class="button">Pechatga berish</div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      data: {}
    };
  },
  created: function() {
    this.data = JSON.parse(localStorage.getItem("Bayonot"));
    // setTimeout(() => {
    //   window.print();
    // }, 1000);
  },
  methods: {
    ChopEtish() {
      let btn = document.querySelector(".button");
      btn.innerHTML = "";
      setTimeout(() => {
        window.print();
      }, 1000);
    }
  }
};
</script>
<style scoped>
.button {
  width: 300px;
  height: 40px;
  text-align: center;
  line-height: 40px;
  border-radius: 5px;
  background-color: aqua;
  color: white;
  margin: 40px auto;
  margin-bottom: 20px;
  cursor: pointer;
}
.back {
  background-color: rgb(231, 229, 229);
}
.shartnoma {
  width: 90%;
  margin: 10px auto;
}
.manzil {
  display: flex;
  justify-content: space-around;
}
.header {
  display: flex;
  justify-content: space-around;
  padding-bottom: 20px;
  border-bottom: 5px solid black;
}
.header1 {
  width: 250px;
  text-align: center;
}
.title {
  text-align: center;
}
.footer {
  display: flex;
  justify-content: space-around;
}
</style>
